 

// Домашнее задание
// 1 задание
// number = 1;
// if (number > 0 && number <= 15){
//     console.log('1 четверть');
// }else if(number > 15 && number <=30){
//     console.log('2 четверть');
// }else if(number > 30 && number <=45){
//     console.log('3 четверть');
// }else if(number > 45 && number <=59){
//     console.log('4 четверть');
// }else{
// console.log('нет такой четверти');
// }
    
// Пример 2
// var lang = 'en';
// if (lang == 'ru') {
// 	var arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
// }
// if (lang == 'en') {
// 	arr = ['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn'];
// }

// alert(arr);

// Пример 3 
// Напишите код, который предлагает пользователю ввести целое 
// число. Нужно вывести на экран сколько в этом числе цифр, 
// а также положительное оно или отрицательное. Например, 
// "Число " + num + " однозначное положительное". 
// Достаточно будет определить, является ли число однозначным, 
// двузначным или трехзначным и более.
// Пример 4
// let red = "нет" , yellow = "нет";
// if (red == "да")
// {console.log("При красном сигнале стоять");
// } else if(yellow == "да")
// {console.log("При желтом надо приготовиться");
// } else
// {console.log("При зеленом надо идти");
// }

// Циклы
// Пример 5
// let i = 1;
// while(i <= 12){
//     console.log(i);
//     i++;
// }

// Пример 6
// let i = 5;
// while(i <= 13){
//     console.log(i);
//     i++;
// }

// Пример 7
// for (let i_7 = 0; i_7 <= 16; i_7++) {
//     if(i_7 % 2 == 0) {
//         console.log(i_7);
//     }
// }
// Пример 8 
// С помощью цикла найдите сумму чисел arr = [2,5,8,3,6]
// let result = 0;
// let arr = [2,5,8,3,6];
// for(let i = 0; i < arr.length; i++){
//     result = result + arr[i];
   
// }
// console.log(result);
